>> x = 1                                                                        
=> 1                                                                            
>> x += 1                                                                       
=> 2                                                                            
>> y = x * 2                                                                    
=> 4                                                                            
>> x, y = 1, 2                                                                  
=> [                                                                            
    [0] 1,                                                                      
    [1] 2                                                                       
]                                                                               
>> x,y,z = [1,2,3]                                                              
=> [                                                                            
    [0] 1,                                                                      
    [1] 2,                                                                      
    [2] 3                                                                       
]                                                                               
>> z                                                                            
=> 3 
>> def polar(x, y)                                                              
|    theta = Math.atan2(y, x)  # açıyı hesapla                                  
|    r = Math.hypot(x, y)      # mesafe                                         
|    [r, theta]                # döndür                                         
|    end                                                                        
=> nil                                                                          
>>                                                                              
 >   d, a = polar(2, 2)                                                         
=> [                                                                            
    [0] 2.8284271247461903,                                                     
    [1] 0.7853981633974483                                                      
]                                                                               
>> d                                                                            
=> 2.8284271247461903                                                           
>> a                                                                            
=> 0.7853981633974483 
